FIZZBUZZ: PROCEDURE OPTIONS (MAIN);
   DECLARE I FIXED BINARY (31);
   DO I = 1 TO 100;
      IF MOD(I, 15) = 0 THEN
         PUT SKIP LIST ('FizzBuzz');
      ELSE IF MOD(I, 3) = 0 THEN
         PUT SKIP LIST ('Fizz');
      ELSE IF MOD(I, 5) = 0 THEN
         PUT SKIP LIST ('Buzz');
      ELSE
         PUT SKIP EDIT (I) (F(3));
   END;
END FIZZBUZZ;
